<template>
  <div class="museumInfomation">
    <v-img class="about" :src="require(`~/assets/image/aboutPic.png`)"> </v-img>
    <br />
    <br />
    <div class="history_box">
      <h2>พิพิธภัณฑ์กายวิภาคและพยาธิวิทยาทางสัตวแพทย์</h2>

      <p>
        ห้องพิพิธภัณฑ์นี้เดิมอยู่ภายใต้การดูแลของคณาจารย์
        สาขาพรีคลินิกทางสัตวแพทย์
        ภาควิชาชีวศาสตร์ทางสัตวแพทย์และสัตวแพทย์สาธารณสุข คณะสัตวแพทยศาสตร์
        มหาวิทยาลัยเชียงใหม่ ตั้งแต่เริ่มมีการจัดตั้งสาขานี้เมื่อปี พ.ศ. 2546
        โดยมีอาจารย์ประจำในขณะนั้นจำนวนสี่คนคน คือ รศ. น.สพ. ดร.กรกฎ
        งานวงศ์พาณิชย์ ผศ. สพ.ญ. ดร.ประภาวดี ไพรินทร์ ผศ. สพ.ญ. ดร.จารุวรรณ คนมี
        ผศ. น.สพ. ดร.วสันต์ ตั้งโภคานนท์ และมีนักวิทยาศาสตร์ประจำหนึ่งคนคือ
        น.ส.ปิยะมาศ คงถึง
      </p>
      <p>
        เดิมห้องพิพิธภัณฑ์เป็นเพียงห้องที่ใช้เก็บรักษาตัวอย่างทางกายวิภาคและมีการแสดงเฉพาะโครงกระดูกสัตว์ชนิดต่าง
        ๆ ได้รับบริจาคมาจากหน่วยงานภาครัฐและเอกชน รวมถึงเจ้าของสัตว์เลี้ยง
        โดยมีนักศึกษา คณะสัตวแพทยศาสตร์ มหาวิทยาลัยเชียงใหม่ เป็นผู้จัดทำ
        วัตถุประสงค์ในครั้งนั้นเพื่อ
        ต้องการมีแหล่งเรียนรู้ให้กับนักศึกษาสัตวแพทย์เอง
        เพราะเป็นช่วงที่คณะสัตวแพทยศาสตร์ มหาวิทยาลัยเชียงใหม่
        พึ่งจัดตั้งได้ไม่นาน
        จึงยังขาดตัวอย่างที่ใช้ในการเรียนการสอนในวิชากายวิภาคศาสตร์
        ต่อมามีตัวอย่างมากขึ้น
        นอกจากใช้สำหรับการเรียนการสอนแล้วจึงเริ่มใช้เพื่อประโยชน์ในงานวิจัยและงานบริการวิชาการอื่น
        ๆ รวมทั้งได้เปิดให้บุคคลทั่วไปเข้าชม ได้แก่ นักเรียน
        นักศึกษาไทยและต่างชาติ รวมถึงแขกจากต่างชาติ
        และมีการนำตัวอย่างไปจัดแสดงในนิทรรศการต่าง ๆ
        เพื่อเป็นการเผยแพร่ความรู้แก่ประชาชน บุคคลทั่วไป
        เนื่องจากปัจจุบันจำนวนตัวอย่างเพิ่มมากขึ้น ทำให้พื้นที่เดิมมีความคับแคบ
        ไม่เพียงพอที่จะใช้เก็บตัวอย่างทางกายวิภาคที่มีอยู่ทั้งหมดได้
        รวมทั้งบริเวณที่เก็บรักษายังเป็นพื้นที่ห้องปฏิบัติการเพื่อการเรียนการสอนเป็นหลัก
        มีการเคลื่อนย้ายตัวอย่าง
        และหากมีการเรียนการสอนเกิดขึ้นจะไม่สามารถเปิดให้เข้าชมได้
        ทำให้ไม่สามารถจัดตั้งเป็นพิพิธภัณฑ์ถาวรได้ ในปี พ.ศ. 2560
        ภาควิชาชีวศาสตร์ทางสัตวแพทย์และสัตวแพทย์สาธารณสุขนำโดย รศ. น.สพ. ดร.กรกฎ
        งานวงศ์พาณิชย์ หัวหน้าภาควิชาฯ ในขณะนั้น
        จึงมีโครงการปรับปรุงห้องจัดแสดงใหม่ในชื่อ
        “พิพิธภัณฑ์กายวิภาคและพยาธิวิทยาทางสัตวแพทย์”
        เพื่อจัดแสดงตัวอย่างทางกายวิภาคและพยาธิวิทยาให้มีความสวยงาม
        เป็นแหล่งเรียนรู้ให้แก่ นักเรียน นักศึกษา และบุคคลทั่วไป
        โดยงบประมาณสำหรับการปรับปรุงห้องทั้งหมดได้จากเงินบริจาคจากผู้มีจิตศรัทธา
        จนสามารถดำเนินการปรับปรุงได้แล้วเสร็จในปี พ.ศ.2562
        และได้มีกำหนดการเปิด“พิพิธภัณฑ์กายวิภาคและพยาธิวิทยาทางสัตวแพทย์”
        อย่างเป็นทางการในวันที่ 21 มีนาคม พ.ศ.2563 แต่เนื่องมาจาก
        สถานการณ์แพร่ระบาดโรค COVID-19 ทำให้กำหนดการพิธีเปิดได้ถูกเลื่อนออกไป
        แต่ทางพิพิธภัณฑ์ ก็ได้เปิดให้บริการแก่นักเรียนนักศึกษาและประชาชนทั่วไป
        ตั้งแต่นั้นมา รอให้
        สถานการณ์โรคระบาดคลี่คลายลงจึงจะได้มีพิธีเปิดอย่างเป็นทางการอีกครั้ง
      </p>
    </div>
    <div class="DonerTable">
      <h4>รายชื่อผู้บริจาค</h4>
      <v-text-field
        v-model="search"
        append-icon="mdi-magnify"
        label="Search"
        single-lined
        hide-details
        dense
      />
      <v-data-table
        :headers="headers"
        :items="doner"
        :items-per-page="5"
        :search="search"
      ></v-data-table>
    </div>
  </div>
</template>

<script>
import { getDoner } from '@/service/doner'
import Vue from 'vue';
export default Vue.extend({
  layout: 'visitor',
  data: () => ({
    search:'',
    headers: [
      {
        text: 'Name',
        align: 'start',
        sortable: false,
        value: 'name',
      },
      { text: 'Lastname', sortable: false, value: 'lastName' },
      { text: 'Donation', value: 'donation' },
    ],
    doner: [],
  }),
  mounted() {
    getDoner().then((res) => {
      console.log(res.data)
      this.doner = res.data
    })
  },
  methods: {},
})
</script>

<style>
.history_box p {
  text-indent: 50px;
  text-align: justify;
  text-justify: inter-word;
}
.DonerTable {
  margin-top: 50px;
}
</style>
